cfg/Documents/ОтражениеЗарплатыВУпрУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ОтражениеЗарплатыВУпрУчете</Name>
			<Comment>(Упр)</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтражениеВУчете</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКосвенныхЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/InformationRegisters/Работники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Работники</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаУвольнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/CalculationRegisters/УправленческиеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<CalculationRegister>
		<Properties>
			<Name>УправленческиеНачисления</Name>
			<Comment>(Упр)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.УправленческиеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВременнойСхемеМотивации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСхемыМотивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыCхемМотивации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

cfg/InformationRegisters/УчетЗаработкаРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>УчетЗаработкаРаботников</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетНачисленийПоОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/ХарактерЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ХарактерЗатрат</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БракВПроизводстве</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенияВоВнеоборотныеАктивы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаСбыт</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщепроизводственныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистративныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОперационныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитываемыеВУправленческомУчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноЗаготовительныеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Catalogs/СпособыОтраженияЗарплатыВУпрУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СпособыОтраженияЗарплатыВУпрУчете</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Documents/ОтражениеЗарплатыВУпрУчете/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПроверкаНаПустойСпособ( ИмяПараметра )
	
	ТекстПроверки = "
	|	ВЫБОР	КОГДА		Начисления.ВидРасчета.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ 
	|				ТОГДА	Начисления.ВидРасчета.СпособОтраженияВУпрУчете." + ИмяПараметра + "  					
	|			КОГДА		УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ 
	|					И	НЕ УчетЗаработкаРаботников.СпособОтраженияВУпрУчете ЕСТЬ NULL 
	|				ТОГДА	УчетЗаработкаРаботников.СпособОтраженияВУпрУчете." + ИмяПараметра + " 			
	|			ИНАЧЕ		&парамСпособПоУмолчанию" + ИмяПараметра + "  		КОНЕЦ
	|";
		
	Возврат ТекстПроверки;
КонецФункции // ПроверкаНаПустойСпособБУ()

Функция ПроверкаНаПустойСпособВзносы( ИмяПараметра )
	
	ТекстПроверки = "
	|	ВЫБОР	КОГДА		УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ 
	|					И	НЕ УчетЗаработкаРаботников.СпособОтраженияВУпрУчете ЕСТЬ NULL 
	|				ТОГДА	УчетЗаработкаРаботников.СпособОтраженияВУпрУчете." + ИмяПараметра + " 			
	|			ИНАЧЕ		&парамСпособПоУмолчанию" + ИмяПараметра + "  		КОНЕЦ
	|";
		
	Возврат ТекстПроверки;
КонецФункции // ПроверкаНаПустойСпособБУ()

Процедура Автозаполнение() Экспорт
 	Перем ВалютаУпрУчета;
	Перем КурсВалютыУпрУчета;

	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ПроведениеРасчетов.ПолучитьКурсВалютыУпрУчета(ПериодРегистрации, ВалютаУпрУчета, КурсВалютыУпрУчета, ВалютаРегламентированногоУчета);
	
	ОтражениеВУчете.Очистить();
	
	// ДанныеУпрУчета
	//	Поля:
	//		СтатьяЗатрат           	- статья затрат управленческго учета
	//		НоменклатурнаяГруппа	- номенклатурная группа управленческго учета
	//		Подразделение
	//		Результат
	//
	//	Описание:
	//	Содержит данные для отражения начисленй в упр. учете
	РаботникПериодПодразделение = "
	|				ВЫБРАТЬ
	|					Работники.ФизЛицо КАК ФизЛицо,
	|					КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ) КАК Период,
	|					Работники.Подразделение КАК Подразделение
	|				ИЗ  РегистрСведений.Работники.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)) КАК Работники
	|			
	|			    ОБЪЕДИНИТЬ
	|				ВЫБРАТЬ
	|					Работники.ФизЛицо КАК ФизЛицо,
	|					Работники.Период КАК Период,
	|					Работники.Подразделение КАК Подразделение
	|				ИЗ  РегистрСведений.Работники.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)) КАК Работники
	|			    ГДЕ
	|			        Работники.Период >= &парамПериодРегистрации
	|			    И   Работники.Период <= КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
	|			    И   ПричинаИзмененияСостояния = &Увольнение
	|";
	
	ДанныеУпрУчетаТекст = "
	|ВЫБРАТЬ
	|	ВсеНачисления.СтатьяЗатрат				КАК СтатьяЗатрат,
	|	ВсеНачисления.НоменклатурнаяГруппа		КАК НоменклатурнаяГруппа,
	|	ВсеНачисления.ОбъектСтроительства 		КАК ОбъектСтроительства,
	|	ВсеНачисления.Подразделение КАК Подразделение,
	|	СУММА(ВсеНачисления.Сумма) КАК Сумма,
	|	СУММА(ВсеНачисления.СуммаКосвенныхЗатрат) КАК СуммаКосвенныхЗатрат
	|ИЗ (
	|	ВЫБРАТЬ
	|	" + ПроверкаНаПустойСпособ( "СтатьяЗатрат" ) + "				КАК СтатьяЗатрат,
	|	" + ПроверкаНаПустойСпособ( "НоменклатурнаяГруппа" ) + "		КАК НоменклатурнаяГруппа,
	|	" + ПроверкаНаПустойСпособ( "ОбъектСтроительства" ) + " 		КАК ОбъектСтроительства,
	|	Начисления.Подразделение	КАК Подразделение,
	|	Начисления.Результат		КАК Сумма,
	|	0 							КАК СуммаКосвенныхЗатрат
	|	ИЗ  РегистрРасчета.УправленческиеНачисления КАК Начисления
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				Начисления.ФизЛицо КАК ФизЛицо,
	|				МАКСИМУМ(УчетЗаработкаРаботников.Период) КАК Период
	|			ИЗ
	|				РегистрРасчета.УправленческиеНачисления КАК Начисления
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|					ПО Начисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо И УчетЗаработкаРаботников.Период <= Начисления.ПериодДействияНачало
	|			
	|			ГДЕ
	|				Начисления.ПериодРегистрации = &парамПериодРегистрации
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Начисления.ФизЛицо) КАК СведенияОРаботникахСрез
	|			ПО СведенияОРаботникахСрез.ФизЛицо = УчетЗаработкаРаботников.Физлицо И СведенияОРаботникахСрез.Период = УчетЗаработкаРаботников.Период
	|		ПО УчетЗаработкаРаботников.Физлицо = Начисления.ФизЛицо
	|
	|	ГДЕ
	|		Начисления.ПериодРегистрации = &парамПериодРегистрации
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		" + ПроверкаНаПустойСпособВзносы( "СтатьяЗатрат" ) + "				КАК СтатьяЗатрат,
	|		" + ПроверкаНаПустойСпособВзносы( "НоменклатурнаяГруппа" ) + "		КАК НоменклатурнаяГруппа,
	|		" + ПроверкаНаПустойСпособВзносы( "ОбъектСтроительства" ) + " 		КАК ОбъектСтроительства,
	|		СведенияОРаботниках.Подразделение КАК Подразделение,
	|		0 КАК Сумма,
	|		Начисления.Результат / &КурсВалютыУпрУчета КАК СуммаКосвенныхЗатрат
	|	ИЗ РегистрРасчета.ВзносыВФонды КАК Начисления
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
	|				ВЫБРАТЬ
	|					РаботникПериод.ФизЛицо КАК ФизЛицо,
	|					МАКСИМУМ(УчетЗаработкаРаботников.Период) КАК Период
	|				ИЗ ( " + РаботникПериодПодразделение + " ) КАК РаботникПериод
	|			
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|				ПО		РаботникПериод.ФизЛицо = УчетЗаработкаРаботников.Физлицо 
	|					И 	УчетЗаработкаРаботников.Период <= РаботникПериод.Период
	|			
	|				СГРУППИРОВАТЬ ПО
	|					РаботникПериод.ФизЛицо
	|			
	|			) КАК СведенияОРаботникахСрез
	|			ПО		СведенияОРаботникахСрез.ФизЛицо = УчетЗаработкаРаботников.Физлицо 
	|				И	СведенияОРаботникахСрез.Период = УчетЗаработкаРаботников.Период
	|				
	|		ПО УчетЗаработкаРаботников.Физлицо = Начисления.Сотрудник.ФизЛицо
	|				
	|		ЛЕВОЕ СОЕДИНЕНИЕ ( " + РаботникПериодПодразделение + " ) КАК СведенияОРаботниках
	|		ПО		СведенияОРаботниках.ФизЛицо = Начисления.Сотрудник.Физлицо 
	|				
	|	ГДЕ
	|		Начисления.ПериодРегистрации = &парамПериодРегистрации
	|		И Начисления.ВидРасчета.СпособРасчета = &ВзносыФОТ
	|		И УчетЗаработкаРаботников.УчетНачисленийПоОрганизации  // ООП 23920
	|   ) КАК ВсеНачисления
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеНачисления.СтатьяЗатрат,
	|	ВсеНачисления.НоменклатурнаяГруппа,
	|	ВсеНачисления.ОбъектСтроительства,
	|	ВсеНачисления.Подразделение
	|	";
	
	Запрос = Новый Запрос(ДанныеУпрУчетаТекст);
	
	Запрос.УстановитьПараметр("парамПустойСпособУУ", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособНеОтражать", Справочники.СпособыОтраженияЗарплатыВУпрУчете.НеОтражатьВУпручете);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСтатьяЗатрат", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию.СтатьяЗатрат);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюНоменклатурнаяГруппа", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию.НоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюОбъектСтроительства", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию.ОбъектСтроительства);
	Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
	
	Запрос.УстановитьПараметр("НачисленоПоБухгалтерииСдельно", ПланыВидовРасчета.УправленческиеНачисления.НачисленоПоБухгалтерииСдельно);
	Запрос.УстановитьПараметр("СдельныйЗаработок", Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок);
	Запрос.УстановитьПараметр("КурсВалютыУпрУчета", КурсВалютыУпрУчета);
	Запрос.УстановитьПараметр("ВзносыФОТ", Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ);
	Запрос.УстановитьПараметр("Увольнение", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	                            
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = ОтражениеВУчете.Добавить();
		
		Строка.Подразделение = Выборка.Подразделение;
		Строка.СтатьяЗатрат = Выборка.СтатьяЗатрат;
		Строка.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппа;
		Строка.ОбъектСтроительства = Выборка.ОбъектСтроительства;
		Строка.Сумма = Выборка.Сумма;
		Строка.СуммаКосвенныхЗатрат = Выборка.СуммаКосвенныхЗатрат;
		
	КонецЦикла;
	
КонецПроцедуры //  Автозаполнение

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА


// Формирует запрос по табличной части ОтражениеВУчете
//
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоДоходам()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Отражение.НомерСтроки,
	|	Отражение.Подразделение,
	|	Отражение.СтатьяЗатрат,
	|	Отражение.НоменклатурнаяГруппа,
	|	Отражение.СтатьяЗатрат.ХарактерЗатрат Как ХарактерЗатрат,
	|	Отражение.СпособРаспределенияЗатрат,
	|	Отражение.ОбъектСтроительства,
	|	Отражение.Сумма КАК Сумма,
	|	Отражение.СуммаКосвенныхЗатрат КАК СуммаКосвенныхЗатрат
	|ИЗ
	|	Документ.ОтражениеЗарплатыВУпрУчете.ОтражениеВУчете КАК Отражение
	|
	|ГДЕ
	|	Отражение.Ссылка = &парамРегистратор
	|
	|ИТОГИ СУММА(Сумма) ПО
	|	ОБЩИЕ");
	
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	Возврат Запрос.Выполнить();
КонецФункции

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(Отказ)

	Если НЕ ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не задан период за который выполняется отражение начислений учете!';uk='Не заданий період за який виконується відображення нарахувань обліку!'"), Отказ);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОтражениеВУчете" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса к ТЧ документа, 
//  Отказ 						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиДохода(ВыборкаПоДоходам, Отказ)
	СтрокаНачалаСообщенияОбОшибке = НСтр("ru='В строке номер ""';uk='У рядку номер ""'")+ СокрЛП(ВыборкаПоДоходам.НомерСтроки)+": ";

	Если ВыборкаПоДоходам.Подразделение.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указано подразделение!';uk='Не вказаний підрозділ!'"), Отказ);
	КонецЕсли;
	
	Если ВыборкаПоДоходам.СтатьяЗатрат = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указана статья затрат!';uk='Не зазначена стаття витрат!'"), Отказ);
	КонецЕсли;
	
	Если ВыборкаПоДоходам.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы и 
		НЕ ЗначениеЗаполнено(ВыборкаПоДоходам.ОбъектСтроительства) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не задан объект строительства!';uk=""Не заданий об'єкт будівництва!"""), Отказ);
	КонецЕсли;
		
	Если ВыборкаПоДоходам.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы и 
		НЕ ЗначениеЗаполнено(ВыборкаПоДоходам.СпособРаспределенияЗатрат) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не задан способ распределения затрат на выпуск продукции!';uk='Не вказаний спосіб розподілу витрат на випуск продукції!'"), Отказ);
	КонецЕсли;
	
Конецпроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
